#### Can anyone explain what is the meaning of this line of code as well what the differnce between expand=True and expand=False and [0]  and  [1] ?

In [ ]:
all_data['Title']= all_data['name'].str.split(', ', expand=True)[1].str.split('.', expand=True)[0]

#### for simplicity and readability let's complete code you have posted on the top ,firstly let's make dataframe named raw_data

In [22]:
import pandas as pd
names = ['Ali, Mr.Mohamed' , 'Hesham, Mrs.Alia' , 'Samer, Mr.Ahmad']
raw_data = pd.DataFrame({'name':names})
raw_data

               name
0   Ali, Mr.Mohamed
1  Hesham, Mrs.Alia
2   Samer, Mr.Ahmad

#### Firslty , Expand=False series index containing list of string as we can see below

In [28]:
raw_data['name'].str.split(',',expand=False)

0     [Ali,  Mr.Mohamed]
1    [Hesham,  Mrs.Alia]
2     [Samer,  Mr.Ahmad]
Name: name, dtype: object

#### Secondly ,Expand the split string into separate columns ,which Expand =True return DataFrame MultiIndex expanding dimensionality which renders a set of columns of strings as we can see below.

In [23]:
raw_data['name'].str.split(expand=True)

         0           1
0     Ali,  Mr.Mohamed
1  Hesham,    Mrs.Alia
2   Samer,    Mr.Ahmad

#### Thirdly , when we use expand=True with [1] which mean get the second column " the column of name 1" as we can see below :

In [29]:
sub_data =raw_data['name'].str.split(',',expand=True)[1]
sub_data

0     Mr.Mohamed
1       Mrs.Alia
2       Mr.Ahmad
Name: 1, dtype: object

#### let's make a column for Title ,if we look above we can see that they're separated by '.' , so we are going to split on the '.' and just take the first thing

In [27]:
raw_data['Title'] = sub_data.str.split('.',expand=True)[0]
raw_data['Title']

0      Mr
1     Mrs
2      Mr
Name: Title, dtype: object

#### we can do that above  with the one line of code as we can see below

In [32]:
raw_data['Title'] = raw_data['name'].str.split(',',expand=True)[1].str.split('.',expand=True)[0]
raw_data['Title']

0      Mr
1     Mrs
2      Mr
Name: Title, dtype: object